cf/Tasks/ЗадачаПользователю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Task>
		<Properties>
			<Name>ЗадачаПользователю</Name>
			<Addressing>InformationRegister.РолиПользователей</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъедененнаяСборка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъедененнаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параллельная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Роли</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

cf/Documents/Инвойс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Инвойс</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДолгиПоИнвойсам</xr:Item>
				<xr:Item>AccumulationRegister.ОплатыИмпорт</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыПоставщиковВПути</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПогрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетВеса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаВеса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ЗакупкаИмпорт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыПакинг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиПоставщика</v8:Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураДляТаможни</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураДляТаможни</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВУпаковке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесНетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесБрутто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Tasks/ЗадачаПользователю/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьБПСборкаЗаказа(СсылкаЗадачи)
	
	Запрос = Новый Запрос(" 
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	БизнесПроцесс.СборкаЗаказа КАК БП
	|ГДЕ
	|	ВедущаяЗадача = &СсылкаЗадачи
	|");
	
	Запрос.УстановитьПараметр("СсылкаЗадачи", СсылкаЗадачи);
	РезультатЗапроса =  Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат БизнесПроцессы.СборкаЗаказа.ПустаяСсылка();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
	 	Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПолучитьИмяФормыЗадачи(Ключ)
	
	МетаПроцесс = Объект.БизнесПроцесс.Метаданные();
	Ключ 		= Параметры.Ключ;
	
	Если МетаПроцесс.Имя = "ЗадачаРазработчику" Тогда
		
		Ключ = Параметры.Ключ.БизнесПроцесс;
		Возврат "БизнесПроцесс.ЗадачаРазработчику.Форма.ФормаВыполненияЗадачи";
		
	ИначеЕсли Объект.ТочкаМаршрута.Вид = ВидТочкиМаршрутаБизнесПроцесса.ВложенныйБизнесПроцесс Тогда
		
		Если Объект.ТочкаМаршрута.Имя = "СборкаЗаказа" Тогда 
			
			Ключ = ПолучитьБПСборкаЗаказа(Параметры.Ключ.Ссылка);
			Возврат "БизнесПроцесс." + Объект.ТочкаМаршрута.Имя + ".Форма.ФормаБизнесПроцесса";
			
			
		Иначе 
			
			// Найдем процесс
			
			
			Текст = "";
			
			Для Каждого МетаПроц ИЗ Метаданные.БизнесПроцессы Цикл
				
				Текст = Текст + ?(Текст = "","","ОБЪЕДИНИТЬ ВСЕ") + "
				|ВЫБРАТЬ """ + МетаПроц.Имя + """ ИмяПроцесса, Ссылка ИЗ БизнесПроцесс." + МетаПроц.Имя + " ГДЕ ВедущаяЗадача = &Задача
				|";
				
			КонецЦикла;
			
			Запрос = Новый Запрос(Текст);
			Запрос.УстановитьПараметр("Задача", Ключ);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				ИмяПроца 	= Выборка.ИмяПроцесса;
				Ключ		= Выборка.Ссылка;
				
			Иначе
				
				ИмяПроца = Объект.БизнесПроцесс.Метаданные().Имя;
				
			КонецЕсли;
			
			Возврат "БизнесПроцесс." + ИмяПроца + ".ФормаОбъекта";
			
		КонецЕсли;
		
	ИначеЕсли МетаПроцесс.Имя = "СогласованиеЗаказаПоставщику" Тогда 
		
		Ключ = Параметры.Ключ.Заказ;
		Возврат "Документ.ЗаказПоставщику.ФормаОбъекта";
		
	ИначеЕсли Объект.ТочкаМаршрута.Вид = ВидТочкиМаршрутаБизнесПроцесса.Действие Тогда
		
		// Отрежим цифру справа если она есть
		ИмяЗадачи = Объект.ТочкаМаршрута.Имя;
		
		// Отработаем исключения
		
		Если Найти(ИмяЗадачи, "СкорректироватьЗаказ") Тогда
			
			ИмяЗадачи = "СкорректироватьЗаказ";
			
		ИначеЕсли Прав(ИмяЗадачи, 1) = "1" Тогда
			
			ИмяЗадачи = Лев(ИмяЗадачи, СтрДлина(ИмяЗадачи) - 1);
			
		КонецЕсли;
		
		// Вернем имя
		
		Возврат "БизнесПроцесс." + МетаПроцесс.Имя + ".Форма.Задача_" + ИмяЗадачи;
		

	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыПродажиВРозницу()
	
	//Если 	Не Объект.Выполнена И
	//		Объект.ТочкаМаршрута = БизнесПроцессы.ПродажаВРозницу.ТочкиМаршрута.ЗакрытиеСмены Тогда
	//		
	//	Возврат Новый Структура("ИмяФормы, Параметры",
	//						"Документ.ЧекККМ.ФормаОбъекта", 
	//						Новый Структура("Процесс",Объект.БизнесПроцесс));
	//Иначе
							
		Возврат Новый Структура("ИмяФормы, Параметры",
							"БизнесПроцесс.ПродажаВРозницу.ФормаОбъекта", 
							Новый Структура("Ключ",Объект.БизнесПроцесс));
	//КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыДляИмпорта()
	
	Если Объект.ТочкаМаршрута = БизнесПроцессы.ЗакупкаИмпорт.ТочкиМаршрута.ЗаполнитьИнвойс Тогда
		Возврат Новый Структура ("ИмяФормы, Параметры", "Документ.Инвойс.Форма.ФормаДокументаБП", Новый Структура("Страница, Процесс, Ключ", 1, Объект.БизнесПроцесс, Объект.БизнесПроцесс.Инвойс));
	ИначеЕсли
		Объект.ТочкаМаршрута = БизнесПроцессы.ЗакупкаИмпорт.ТочкиМаршрута.ЗаполнитьПакингЛист Тогда
		Возврат Новый Структура ("ИмяФормы, Параметры", "Документ.Инвойс.Форма.ФормаДокументаБП", Новый Структура("Страница, Процесс, Ключ", 2, Объект.БизнесПроцесс, Объект.БизнесПроцесс.Инвойс));
	ИначеЕсли
		Объект.ТочкаМаршрута = БизнесПроцессы.ЗакупкаИмпорт.ТочкиМаршрута.РассчитатьСебестоимость Тогда
		Возврат Новый Структура ("ИмяФормы, Параметры", "Документ.РасчетСебестоимости.ФормаОбъекта", Новый Структура("Основание, Ключ", Объект.БизнесПроцесс.Инвойс, Объект.БизнесПроцесс.РасчетСебестоимости));
	ИначеЕсли
		Объект.ТочкаМаршрута = БизнесПроцессы.ЗакупкаИмпорт.ТочкиМаршрута.ОформитьПоступлениеТоваров Тогда
		Возврат Новый Структура ("ИмяФормы, Параметры", "Документ.ПоступлениеТоваров.ФормаОбъекта", Новый Структура("Основание, Ключ", Объект.БизнесПроцесс.Инвойс, Объект.БизнесПроцесс.ПоступлениеТоваров));
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Перем Ключ;
	
	Если Не НеОткрыватьДругуюФорму Тогда
		
		Отказ = Истина;
		
		Если ТипЗнч(Объект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ПродажаВРозницу") Тогда
			
			текПараметры = ПолучитьПараметрыПродажиВРозницу();
			ОткрытьФорму(текПараметры.ИмяФормы, текПараметры.Параметры, ВладелецФормы,,Окно);
		ИначеЕсли
			ТипЗнч(Объект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ЗакупкаИмпорт") Тогда
			текПараметры = ПолучитьПараметрыДляИмпорта();
			ОткрытьФорму(текПараметры.ИмяФормы,  текПараметры.Параметры, ВладелецФормы,, Окно);

		ИначеЕсли
			ТипЗнч(Объект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.СогласованиеЗаказаПоставщику") Тогда
			
			ИмяОткрФормы = ПолучитьимяФормыЗадачи(Ключ);
		 	ОткрытьФорму(ИмяОткрФормы, Новый Структура("Ключ, Задача, Процесс, ТочкаМаршрута", Ключ, Объект.Ссылка, Объект.БизнесПроцесс, Объект.ТочкаМаршрута), ВладелецФормы,, Окно);
		Иначе	

			ИмяОткрФормы = ПолучитьимяФормыЗадачи(Ключ);
		 	ОткрытьФорму(ИмяОткрФормы, Новый Структура("Ключ", Ключ), ВладелецФормы,, Окно);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НеОткрыватьДругуюФорму = ЭтаФОрма.Параметры.НеОткрыватьДругуюФорму = Истина;	
	
КонецПроцедуры
